{
    "InternalName": "BattanKing",
    "Notes": "A large stone block boss. He can summon Whimps that will try to attack the player like Whomps do. The boss himself can defeat those smaller blocks by crushing them. Like his smaller counterparts, this boss will try to fall onto the player to attack them. He can also attack using shockwaves that appear when he jumps. When he's lying on ground, the player can Ground Pound the weak spot on its back to damage him. After hitting the boss three times, he will be defeated. He always spawns a Power Star.\nHe uses two GeneralPos. バッタンキング基準位置 is used as his position after the battle. マリオ位置 is used to position the player after the battle. Several messages are also required. BattanKing000 specifies the introduction text. BattanKing001 specifies the text after defeating him. Lastly, the actual cutscenes have to be specified as well: バッタンキング登場 for the opening and バッタンキングダウン for the outro.",
    "Games": 2,
    "Progress": 2,
    "Parameters": {
        "Obj_arg7": {
            "Name": "Camera Register Starting Index",
            "Type": "Integer",
            "Games": 2,
            "Needed": false,
            "Description": "Specifies the starting index of the camera vector register. Occupies two cameras.",
            "Values": [],
            "Exclusives": []
        },
        "SW_DEAD": {
            "Games": 2,
            "Needed": false,
            "Description": "Gets activated after defeating the boss.",
            "Exclusives": []
        },
        "SW_A": {
            "Games": 2,
            "Needed": true,
            "Description": "Starts the intro cutscene if the switch gets activated.",
            "Exclusives": []
        },
        "AppearPowerStar": {
            "Games": 2,
            "Needed": true,
            "Description": "Spawned after defeating it.",
            "Exclusives": []
        },
        "BaseMtxFollowTarget": {
            "Games": 2,
            "Needed": false,
            "Exclusives": []
        }
    }
}