{
    "InternalName": "EffectObj50x50x10SyncClipping",
    "Notes": "A generic particles effect with a clipping radius of 2500 and a far clipping distance of 50.  Furthermore, its clipping center is at (0, 200, 0). The actual particle emitting is also dependent on the object's clipping.  The particle data needs to be specified in AutoEffectList. The UniqueName also matches the object's name. It can also use sound effects. EffectEmitStart specifies the sound effect used when it starts functioning. EffectEmitting specifies the looping sound effect that is played while particles are emitting.",
    "Games": 3,
    "Progress": 2,
    "Parameters": {
        "Obj_arg0": {
            "Name": "Invert Cutscene Function?",
            "Type": "Boolean",
            "Games": 2,
            "Needed": false,
            "Description": "If set, the object will stop functioning if the cutscene action gets triggered.",
            "Values": [],
            "Exclusives": []
        },
        "SW_A": {
            "Games": 3,
            "Needed": false,
            "Description": "If used, it will emit particles only if this switch is activated.",
            "Exclusives": []
        },
        "SW_AWAKE": {
            "Games": 2,
            "Needed": false,
            "Description": "The object will become visible and resume movement hwhen this switch is activated.",
            "Exclusives": []
        },
        "Group": {
            "Games": 3,
            "Needed": false,
            "Description": "Registers effects of the same object type, but the group is never used for anything.",
            "Exclusives": []
        },
        "ClippingGroup": {
            "Games": 3,
            "Needed": false,
            "Description": "Objects in this group are always clipped together.",
            "Exclusives": []
        },
        "DemoCast": {
            "Games": 3,
            "Needed": false,
            "Description": "If used, it will start functioning once its cutscene action gets triggered. In SMG2, it will stop functioning if Obj_arg0 is set.",
            "Exclusives": []
        },
        "DemoSimpleCast": {
            "Games": 3,
            "Needed": false,
            "Description": "This object will not pause its movement during cutscenes, NPC conversations, etc.",
            "Exclusives": []
        }
    }
}