{
    "InternalName": "KinopioPostman",
    "Notes": "A variant of the iconic mushroom NPC that delivers special letters, such as those that open up a new mission. The letters and their appearance conditions are defined in the game's code. Initially, it will be hidden, until the player has collected 13 Power Stars. Additional Kinopio instances can be linked to it using GeneratorId. Due to its complexity, its individual message flow functions are explained on the Luma's Workshop wiki.",
    "Games": 2,
    "Progress": 2,
    "Parameters": {
        "SW_APPEAR": {
            "Games": 2,
            "Needed": false,
            "Description": "Very buggy so it shouldn't be used. The object will appear when this switch is activated, but it will always have appeared even if the switch is deactivated. Deactivating the switch again will fix this, though.",
            "Exclusives": []
        },
        "SW_DEAD": {
            "Games": 2,
            "Needed": false,
            "Description": "Gets activated when it dies.",
            "Exclusives": []
        },
        "SW_A": {
            "Games": 2,
            "Needed": true,
            "Description": "When activated, the game will check if the player has collected at least 13 Power Stars. If true, Mailtoad will appear.",
            "Exclusives": []
        },
        "SW_B": {
            "Games": 2,
            "Needed": false,
            "Description": "Activated or deactivated depending on the used event flow node.",
            "Exclusives": []
        },
        "SW_AWAKE": {
            "Games": 2,
            "Description": "The object will become visible and resume movement when this switch is activated.",
            "Exclusives": []
        },
        "Rail": {
            "Games": 2,
            "Needed": true,
            "Description": "The path that it moves on.",
            "Exclusives": []
        },
        "GeneralPos": {
            "Games": 2,
            "Needed": true,
            "Description": "マリオ位置[郵便屋さんイベント] defines the player's position when talked to.",
            "Exclusives": []
        },
        "Message": {
            "Games": 2,
            "Needed": false,
            "Description": "The text message ID to be used. Needs to be specified in the zone's text file.",
            "Exclusives": []
        },
        "DemoCast": {
            "Games": 2,
            "Needed": false,
            "Description": "It will register to several cutscenes used on Starship Mario. Its special cutscene action functor causes it to reappear at its initial position. The cutscenes that it registers to are ファイルセレクトからの開始, 郵便屋さんイベント[タスク], 郵便屋さんイベント[ロゼッタ], グランドスター帰還[２回目以降], パワースター帰還, パワースター帰還[NPC紹介], パワースター帰還[アイテム惑星], パワースター帰還[初回] and でしゃばりルイージ終了.",
            "Exclusives": []
        },
        "MarioFaceShipNpcRegister": {
            "Games": 2,
            "Needed": false,
            "Description": "This object can be registered to a Starship Mario NPC appearance event.",
            "Exclusives": []
        },
        "YoshiLockOnTarget": {
            "Games": 2,
            "Description": "This object can be targeted and licked by Yoshi.",
            "Exclusives": []
        },
        "SearchTurtle": {
            "Games": 2,
            "Description": "Red Koopa Shells and Gold Shells home in on this object.",
            "Exclusives": []
        }
    }
}