{
    "InternalName": "AnmModelSwitchSyncBrk",
    "Name": "AnmModelSwitchSyncBrk",
    "Notes": "A generic object with a model, collision and a Reverse.brk animation that will play its Move and Reverse.brk animations once certain conditions are met. The Reverse.brk animation's last frame will be used until the conditions are met. It uses several sound effects. AnmModelMoveStart specifies the sound effect used when it starts moving. AnmModelMoveLoop specifies the looping sound effect that is played while it moves. AnmModelStop specifies the sound effect used when it stops moving. AnmModelReverse specifies the sound effect used when the Reverse.brk animations starts playing. Furthermore, it can use several particle effects as well. Start specifies the particles used when it starts moving. EndLoop specifies the particles used after it stopped moving. It can also shake the screen and rumble the player's Wiimote if a proper PadAndCameraCtrl file is provided. Lastly, it also supports an optional Bloom model.",
    "Games": 2,
    "Progress": 2,
    "Parameters": {
        "SW_APPEAR": {
            "Games": 3,
            "Needed": false,
            "Description": "Appears when this switch is activated.",
            "Exclusives": []
        },
        "SW_DEAD": {
            "Games": 2,
            "Needed": false,
            "Description": "Can be activated when the object is killed through a cutscene action.",
            "Exclusives": []
        },
        "SW_A": {
            "Games": 2,
            "Needed": false,
            "Description": "If used, the object starts moving when this switch is activated. This switch will be ignored if it registered a cutscene nerve action.",
            "Exclusives": []
        },
        "SW_AWAKE": {
            "Games": 3,
            "Description": "Enables rendering and resumes updates when this switch is active.",
            "Exclusives": []
        },
        "DemoCast": {
            "Games": 3,
            "Needed": false,
            "Description": "Can take part in a cutscene. Its special cutscene nerve action makes it start moving.",
            "Exclusives": []
        }
    }
}