{
    "InternalName": "HipDropMoveBlock",
    "Name": "HipDropMoveBlock",
    "Notes": "An object with a model and collision that can be Ground Pounded to move it away from its initial position. The distance, required Ground Pounds and more can be configured. Initially, the object can only be Ground Pounded from the bottom side of the model to move it upwards. It can play various different sounds: Start, Moving, StopEnd and Stop, all of which are self-explanatory. Interestingly, the class offers an unused functionality where one or more buttons (HipDropMoveBlockSwitch) can be attached to the object that will cause the object to move when one of the buttons has been stomped. The positions and offsets can be defined in a file called InitHipDropMoveBlockSwitch.bcsv. The actual model for the button actor does not exist anymore and needs to be restored. Unfortunately, the button does not take the object's rotation into account when placed.",
    "Games": 2,
    "Progress": 2,
    "Parameters": {
        "Obj_arg0": {
            "Name": "Movement Distance",
            "Type": "Float",
            "Games": 2,
            "Needed": false,
            "Description": "How far the block can be pushed upwards from its initial position. Default is 100.",
            "Values": [],
            "Exclusives": []
        },
        "Obj_arg1": {
            "Name": "Required Ground Pounds",
            "Type": "Integer",
            "Games": 2,
            "Needed": false,
            "Description": "How often the block has to be Ground Pounded in order to reach the end. Default is 1.",
            "Values": [],
            "Exclusives": []
        },
        "Obj_arg2": {
            "Name": "Movement Time",
            "Type": "Integer",
            "Games": 2,
            "Needed": false,
            "Description": "How long it takes to move the object after Ground Pounding it. Default is 60.",
            "Values": [],
            "Exclusives": []
        },
        "Obj_arg3": {
            "Name": "Limit Type",
            "Type": "Integer",
            "Games": 2,
            "Needed": false,
            "Description": "Specifies how to restrict the movement of the block.",
            "Values": [
                {
                    "Value": "-1",
                    "Notes": "Can be Ground Pounded from bottom and top sides"
                },
                {
                    "Value": "0",
                    "Notes": "Can only be Ground Pounded from bottom side"
                }
            ],
            "Exclusives": []
        },
        "Obj_arg4": {
            "Name": "Useless",
            "Type": "Integer",
            "Games": 2,
            "Needed": false,
            "Description": "Read but never used for anything.",
            "Values": [],
            "Exclusives": []
        },
        "SW_A": {
            "Games": 2,
            "Needed": false,
            "Description": "Gets activated after the object has been moved to its end.",
            "Exclusives": []
        },
        "SW_B": {
            "Games": 2,
            "Needed": false,
            "Description": "If used, the spot can only be Ground Pounded while this switch is activated.",
            "Exclusives": []
        },
        "SW_AWAKE": {
            "Games": 2,
            "Description": "The object will become visible and resume movement when this switch is activated.",
            "Exclusives": []
        },
        "ClippingGroup": {
            "Games": 2,
            "Description": "Objects in this group are always clipped together.",
            "Exclusives": []
        },
        "DemoCast": {
            "Games": 2,
            "Needed": false,
            "Description": "The object takes part in the cutscene.",
            "Exclusives": []
        },
        "BaseMtxFollowTarget": {
            "Games": 2,
            "Description": "Objects of this class can be followed by another BaseMtxFollower object.",
            "Exclusives": []
        }
    }
}