{
    "InternalName": "PetitPorter",
    "Name": "PetitPorter",
    "Notes": "A dish that teleports the player to a specified destination point. It can be activated by using a Spin Attack while standing on it. The player will be teleported back to the teleporter after the specified amount of time elapsed. The destination point (PetitPorterWarpPoint) needs to be specified, however, the return point (PetitPorterExitPoint) can be specified.",
    "Games": 2,
    "Progress": 2,
    "Parameters": {
        "Obj_arg0": {
            "Name": "Teleporter Group ID",
            "Type": "Integer",
            "Games": 2,
            "Needed": false,
            "Description": "The teleporter's group which can be used to link warp and exit points to it.",
            "Values": [],
            "Exclusives": []
        },
        "Obj_arg1": {
            "Name": "Timer",
            "Type": "Integer",
            "Games": 2,
            "Needed": false,
            "Description": "How long it takes before the player gets teleported back again. Default is 600.",
            "Values": [],
            "Exclusives": []
        },
        "SW_APPEAR": {
            "Games": 2,
            "Needed": false,
            "Description": "The object will appear when this switch is activated.",
            "Exclusives": []
        },
        "SW_A": {
            "Games": 2,
            "Needed": false,
            "Description": "Gets activated while the teleporter is still active. Gets deactivated once it becomes unusable.",
            "Exclusives": []
        },
        "SW_B": {
            "Games": 2,
            "Needed": false,
            "Description": "Gets activated once the player teleports to the destination and gets deactivated again after the timer runs out.",
            "Exclusives": []
        },
        "Camera": {
            "Games": 2,
            "Needed": false,
            "Description": "Used for multiple warping circumstances. 基点でワープイン is used when warping from the teleporter. ワープ点でワープアウト is used when the player appears at the destination point. ワープ点でワープイン is used when the player gets teleported after the timer runs out. 基点でワープアウト is used when the player appears at the return point.",
            "Exclusives": []
        }
    }
}