{
    "InternalName": "RotateSeesawTrampoline",
    "Name": "RotateSeesawTrampoline",
    "Notes": "A seesaw-like platform that rotates when stepped on. Unlike SimpleSeesawObj, it uses two particle effects named Wait and Move that won't be rotated. It supports three rotation modes. Furthermore, it can use optional sound effects. If RotateAxis is 0, the sounds are MapPartsSeesaw1AxisRotatorBound and MapPartsSeesaw1AxisRotatorMove. If RotateAxis is 1, the only sound is MapPartsRotateLoop. If RotateAxis is 2, the only sound is MapPartsSeesaw2AxisRollerRotatorMove.",
    "Games": 2,
    "Progress": 2,
    "Parameters": {
        "RotateSpeed": {
            "Name": "Rotation Speed",
            "Games": 2,
            "Description": "How fast it rotates. Default is 0. Only used if RotateAxis is 0.",
            "Exclusives": []
        },
        "RotateAngle": {
            "Name": "Rotation Angle",
            "Games": 2,
            "Description": "How many angles in degrees the platform rotates. Default is 0.",
            "Exclusives": []
        },
        "RotateAxis": {
            "Name": "Rotation Type",
            "Games": 2,
            "Description": "How the platform moves when stepped on. Default corresponds to 1.",
            "Values": [
                {
                    "Value": "0",
                    "Notes": "Rotate around Z axis, returns to original rotation"
                },
                {
                    "Value": "1",
                    "Notes": "Rotate XZ plane, returns to original rotation"
                },
                {
                    "Value": "2",
                    "Notes": "Rotate XZ plane (SMG2 only)"
                }
            ],
            "Exclusives": []
        },
        "RotateAccelType": {
            "Name": "Inertia Factor / Acceleration",
            "Games": 2,
            "Description": "Affects how long it will remain in motion. If RotateAxis is 0 or 1, it also affects how fast rotation will speed up. Default is 0.",
            "Values": [],
            "Exclusives": []
        },
        "RotateStopTime": {
            "Name": "Restore Force",
            "Games": 2,
            "Description": "The force used to restore its original rotation after getting of the platform. Only used if RotateAxis is 0 or 1.",
            "Exclusives": []
        },
        "SW_APPEAR": {
            "Games": 2,
            "Needed": false,
            "Description": "The object will appear when this switch is activated.",
            "Exclusives": []
        },
        "SW_DEAD": {
            "Games": 2,
            "Needed": false,
            "Description": "Can be activated when the object is killed through a cutscene action.",
            "Exclusives": []
        },
        "SW_AWAKE": {
            "Games": 2,
            "Description": "The object will become visible and resume movement when this switch is activated.",
            "Exclusives": []
        },
        "DemoCast": {
            "Games": 2,
            "Needed": false,
            "Description": "The object takes part in the cutscene.",
            "Exclusives": []
        }
    }
}